# Descriptive Statistics for Psychology Students

Import pandas (Data Analysis Library)

Renaming as 'pd' is not strictly neccesary but can help reduce typing.

In [32]:
import pandas as pd

Use pandas <strong>'read_csv'</strong> method to read in a .csv file and store in the variable named <strong>'data_file'</strong>

In [33]:
data_frame = pd.read_csv('DATA/Average-prices-2018-02.csv')

Use pandas <strong>head</strong> method to show the <strong>top 5</strong> rows of the dataframe.

In [34]:
data_frame.head()

,Date,Region_Name,Area_Code,Average_Price,Monthly_Change,Annual_Change,Average_Price_SA
0,1968-04-01,England,E92000001,3408.108064,0.0,NaN,NaN
1,1968-04-01,Scotland,S92000003,2844.980688,0.0,NaN,NaN
2,1968-04-01,Northern Ireland,N92000001,3661.485500,0.0,NaN,NaN
3,1968-04-01,Wales,W92000004,2885.414162,0.0,NaN,NaN
4,1968-04-01,West Midlands Region,E12000005,3328.858802,0.0,NaN,NaN

Use pandas <strong>info</strong> method to get info on <strong>datatypes</strong>.

In [35]:
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 121023 entries, 0 to 121022
Data columns (total 7 columns):
Date                121023 non-null object
Region_Name         121023 non-null object
Area_Code           121023 non-null object
Average_Price       121023 non-null float64
Monthly_Change      120557 non-null float64
Annual_Change       115707 non-null float64
Average_Price_SA    3834 non-null float64
dtypes: float64(4), object(3)
memory usage: 6.5+ MB

Use pandas <strong>tail</strong> method to show the <strong>last 5</strong> rows of the dataframe.

In [36]:
data_frame.tail()

,Date,Region_Name,Area_Code,Average_Price,Monthly_Change,Annual_Change,Average_Price_SA
121018,2018-02-01,Pembrokeshire,W06000009,160952.7393,-1.617576,-0.848566,NaN
121019,2018-02-01,Carmarthenshire,W06000010,138802.7509,-0.930989,5.739570,NaN
121020,2018-02-01,England and Wales,K04000001,236909.2102,0.157427,4.110893,237248.2965
121021,2018-02-01,Great Britain,K03000001,227784.4930,-0.131574,4.313432,230442.7459
121022,2018-02-01,United Kingdom,K02000001,225047.1950,-0.060642,4.411545,225369.3132

Get the <strong>number of rows</strong> in the data frame.

In [38]:
len(data_frame)

121023

Change to two decimal places.

In [39]:
pd.set_option("display.precision", 2)

Check it has taken effect.

In [40]:
data_frame.tail()

,Date,Region_Name,Area_Code,Average_Price,Monthly_Change,Annual_Change,Average_Price_SA
121018,2018-02-01,Pembrokeshire,W06000009,160952.74,-1.62,-0.85,NaN
121019,2018-02-01,Carmarthenshire,W06000010,138802.75,-0.93,5.74,NaN
121020,2018-02-01,England and Wales,K04000001,236909.21,0.16,4.11,237248.30
121021,2018-02-01,Great Britain,K03000001,227784.49,-0.13,4.31,230442.75
121022,2018-02-01,United Kingdom,K02000001,225047.20,-0.06,4.41,225369.31

Get some basic descriptive statistics using the <strong>describe</strong> method.

In [41]:
data_frame.describe()

       Average_Price  Monthly_Change  Annual_Change  Average_Price_SA
count       1.21e+05       120557.00      115707.00           3834.00
mean        1.51e+05            0.60           7.05         142085.91
std         9.86e+04            2.06           9.42          70399.99
min         2.71e+03          -30.30         -35.79          40405.31
25%         8.24e+04           -0.45           1.72          87284.77
50%         1.36e+05            0.56           6.17         137658.66
75%         1.94e+05            1.59          11.67         177898.82
max         1.46e+06           35.29          98.44         481337.12

# Exploratory data analysis